[
  {
    "id": 1,
    "title": "Google",
    "subheading": "Janeesh P",
    "description": "My journey to Google was a challenging yet rewarding experience. Through rigorous preparation and a series of technical interviews, I showcased my skills and landed a role at Google, where I now contribute to innovative projects."
  },
  {
    "id": 2,
    "title": "Microsoft",
    "subheading": "Janeesh P",
    "description": "My determination and expertise in software development secured me a position at Microsoft. After excelling in multiple rounds of interviews, I joined the team and am now working on cutting-edge technologies."
  },
  {
    "id": 3,
    "title": "Amazon",
    "subheading": "Janeesh P",
    "description": "With a strong background in data analysis and machine learning, I impressed the interviewers at Amazon. My problem-solving skills and technical knowledge earned me a spot in the company's data science team."
  },
  {
    "id": 4,
    "title": "Facebook",
    "subheading": "Janeesh P",
    "description": "My journey to Facebook involved mastering various coding challenges and acing multiple interviews. My ability to handle complex problems and innovate led to my successful placement at Facebook as a project manager."
  },
  {
    "id": 5,
    "title": "Apple",
    "subheading": "Janeesh P",
    "description": "Getting into Apple was a dream come true. I went through a series of intense interviews, and my passion for creating seamless user interfaces helped me secure a role as a frontend developer at Apple."
  },
  {
    "id": 6,
    "title": "Netflix",
    "subheading": "Janeesh P",
    "description": "Joining Netflix was an exciting journey. My skills in server-side development and database management impressed the team, and I was thrilled to accept the offer to work on robust backend systems at Netflix."
  },
  {
    "id": 7,
    "title": "Tesla",
    "subheading": "Janeesh P",
    "description": "Securing a position at Tesla was a remarkable achievement. My expertise in automating deployment processes and managing cloud infrastructure played a key role in my success during the interviews."
  },
  {
    "id": 8,
    "title": "Spotify",
    "subheading": "Janeesh P",
    "description": "At Spotify, my passion for designing user-centered products and improving user experiences shone through. The interview process was tough, but my dedication to creating intuitive designs led to my role as a product designer."
  }
]
